Конфигурация/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксНумерации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Comment>Ранее этой даты проведение документов запрещено</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОтветственныхЗаОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПодтвержденийОпераций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольДоступаКСчетамДоверительногоУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПапкиВФайловомХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ДоступныеСчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеСчетаДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Организации/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "ЮрФизЛицо");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// блокирующие проверки
	Если Ссылка.ЮрФизЛицо <> ЮрФизЛицо
		ИЛИ Ссылка.ВалютаУчета <> ВалютаУчета
		ИЛИ Ссылка.ДатаНачалаУчета <> Ссылка.ДатаНачалаУчета Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		РаботаСНормативноСправочнойИнформацией.ПроверкаНаНаличиеФункциональнойРоли(ЭтотОбъект, Отказ);
		
		// проверим, чтобы при изменении даты начала учета отсутствовали проведенные документы
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата",        ЭтотОбъект.ДатаНачалаУчета);
		Запрос.УстановитьПараметр("Период",      ЭтотОбъект.ДатаНачалаУчета - 86400);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Ссылка);
		
		Для каждого ДокументМД Из Метаданные.Документы Цикл
			Если ДокументМД.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
				Если ПустаяСтрока(Запрос.Текст) Тогда
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ """ + ДокументМД.ПолноеИмя() + """ КАК ИмяОбъектаМД, ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Документ ИЗ Документ." + ДокументМД.Имя + " ГДЕ Проведен И Организация = &Организация И Дата < &Дата";
				Иначе
					Запрос.Текст = Запрос.Текст + Символы.ПС
						+ "ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ """ + ДокументМД.ПолноеИмя() + """, ПРЕДСТАВЛЕНИЕ(Ссылка) ИЗ Документ." + ДокументМД.Имя + " ГДЕ Проведен И Организация = &Организация И Дата < &Дата";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//// движения запрещены, начиная с предыдущего дня, т.к. нам нужен ввод начальных остатков
		//Для каждого РегистрМД Из Метаданные.РегистрыНакопления Цикл
		//	Запрос.Текст = Запрос.Текст + Символы.ПС
		//		+ "ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ """ + РегистрМД.ПолноеИмя() + """, ПРЕДСТАВЛЕНИЕ(Регистратор) ИЗ РегистрНакопления." + РегистрМД.Имя + " ГДЕ Организация = &Организация И Период < &Период";
		//КонецЦикла;
		//
		//Для каждого РегистрМД Из Метаданные.РегистрыБухгалтерии Цикл
		//	Запрос.Текст = Запрос.Текст + Символы.ПС
		//		+ "ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ """ + РегистрМД.ПолноеИмя() + """, ПРЕДСТАВЛЕНИЕ(Регистратор) ИЗ РегистрБухгалтерии." + РегистрМД.Имя + " ГДЕ Организация = &Организация И Период < &Период";
		//КонецЦикла;
		
		//Для каждого РегистрМД Из Метаданные.РегистрыСведений Цикл
		//	Если РегистрМД.Измерения.Найти("Организация") <> Неопределено
		//		И РегистрМД.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический
		//		И РегистрМД.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.ПозицияРегистратора // считаем, что по ним контроль будет осуществляться при проведении регистратора
		//	Тогда
		//		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ РАЗРЕШЕННЫЕ """ + РегистрМД.ПолноеИмя() + """, ПРЕДСТАВЛЕНИЕ(Регистратор) ИЗ РегистрСведений." + РегистрМД.Имя + " ГДЕ Организация = &Организация И Период < &Период";
		//	КонецЕсли;
		//КонецЦикла;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		МаксКоличествоСообщений = 20; // чтобы процесс вывода сообщений не завесил систему, ибо он может :((
		КоличествоСообщений = 0;
		
		Пока Выборка.Следующий() Цикл
			Если КоличествоСообщений > МаксКоличествоСообщений Тогда
				Прервать;
			КонецЕсли;
			
			Если      Найти(Выборка.ИмяОбъектаМД, "Документ.") = 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ранее даты начала учета присутствует проведенный документ '" + Выборка.Документ + "'",,,, Отказ);
			ИначеЕсли Найти(Выборка.ИмяОбъектаМД, "РегистрНакопления.") = 1 Или Найти(Выборка.ИмяОбъектаМД, "РегистрБухгалтерии.") = 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ранее даты, предшествующей дате начала учета, присутствуют движения по регистру '" + Выборка.ИмяОбъектаМД + "', зарегистрованные документом '" + Выборка.Документ + "'",,,, Отказ);
			КонецЕсли;
			
			КоличествоСообщений = КоличествоСообщений + 1;
		КонецЦикла;
		
		Если КоличествоСообщений > МаксКоличествоСообщений Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("…",,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИзмененКонтрольДоступаКСчетамДоверительногоУправления", НЕ ЭтоНовый() И КонтрольДоступаКСчетамДоверительногоУправления <> Ссылка.КонтрольДоступаКСчетамДоверительногоУправления);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.ВидыДеятельностиОрганизации.ПриЗаписиОбъекта(ЭтотОбъект);
	
	Если ДополнительныеСвойства.Свойство("ИзмененКонтрольДоступаКСчетамДоверительногоУправления")
		И ДополнительныеСвойства.ИзмененКонтрольДоступаКСчетамДоверительногоУправления Тогда
		
		// Включили контроль.
		Если КонтрольДоступаКСчетамДоверительногоУправления Тогда
			
			Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.ОбновитьДанныеОДоступностиСчетовДоверительногоУправленияПоОрганизации(Ссылка) Тогда
				ТекстСообщения = СтрШаблон("Не удалось записать организацию из-за ошибки при установке по ней доступности счетов доверительного управления!", Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		// Отключили контроль.
		Иначе
			
			Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.УдалитьДанныеОДоступностиСчетовДоверительногоУправления(Ссылка) Тогда
				ТекстСообщения = СтрШаблон("Не удалось записать организацию из-за ошибки при отклбчении по ней доступности счетов доверительного управления!", Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи
